Tekla Open API Reference for Tekla Structures 2025
IEvents.ProjectInfoChanged Event
 The ProjectInfoChanged event is raised just after some changes have been made to the project info.
Note, this event is however not triggered when UNDO or REDO are performed.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.ProjectInfoChangedDelegate ProjectInfoChanged
Event ProjectInfoChanged As Events.ProjectInfoChangedDelegate
Value
Type: Tekla.Structures.Model.Events.ProjectInfoChangedDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace